RSN/src/InformationRegisters/ОчередьОбработкиДанных/ОчередьОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиДанных</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтруктура</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбменДанных</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ОчередьОбработкиДанных/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Процедура ОбработататьСтрокуОчередиНаСервере(ИдентификаторыОбработчика)
	
	ОбработкаДанных.ОбработатьОчередь(ИдентификаторыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработататьСтрокуОчереди(Команда) 
	
	ТекДанные = Элементы.Список.ТекущиеДанные; 
	Если ТекДанные.Обработано Тогда
		ПоказатьПредупреждение(,НСтр("ru='Повторно обработать можно только запись с ошибкой.'"),5);
		Возврат;
	КонецЕсли;     
	
	ОбработататьСтрокуОчередиНаСервере(Новый Структура("Идентификатор, ВремяИнициации, ИнформационнаяБаза", 
										ТекДанные.Идентификатор, ТекДанные.ВремяИнициации, ТекДанные.ИнформационнаяБаза));  

	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработататьСтрокуОчередиБезПроверки(Команда) 
	
	ТекДанные = Элементы.Список.ТекущиеДанные; 
	//Если ТекДанные.Обработано Тогда
	//	ПоказатьПредупреждение(,НСтр("ru='Повторно обработать можно только запись с ошибкой.'"),5);
	//	Возврат;
	//КонецЕсли;     
	
	ОбработататьСтрокуОчередиНаСервере(Новый Структура("Идентификатор, ВремяИнициации, ИнформационнаяБаза", 
										ТекДанные.Идентификатор, ТекДанные.ВремяИнициации, ТекДанные.ИнформационнаяБаза));  

	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатНаСервере(ДанныеСтрок) 
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	ОчередьОбработкиДанных.Идентификатор КАК Идентификатор,
	               |	ОчередьОбработкиДанных.ВремяИнициации КАК ВремяИнициации,
	               |	ОчередьОбработкиДанных.ОбменДанных КАК ОбменДанных,
	               |	ОчередьОбработкиДанных.ИнформационнаяБаза КАК ИнформационнаяБаза
	               |ИЗ
	               |	РегистрСведений.ОчередьОбработкиДанных КАК ОчередьОбработкиДанных
	               |ГДЕ
	               |	ЛОЖЬ";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Эл Из ДанныеСтрок Цикл 
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Эл);
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОбработкиДанных.Идентификатор КАК Идентификатор,
		|	ОчередьОбработкиДанных.ВремяИнициации КАК ВремяИнициации,
		|	ОчередьОбработкиДанных.ОбменДанных КАК ОбменДанных,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза КАК ИнформационнаяБаза
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ОчередьОбработкиДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОчередьОбработкиДанных.Идентификатор КАК Идентификатор,
		|	ОчередьОбработкиДанных.ВремяИнициации КАК ВремяИнициации,
		|	ОчередьОбработкиДанных.ОбменДанных КАК ОбменДанных,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОчередьОбработкиДанных.ОбменДанных) КАК ОбменДанныхПредставление,
		|	ОчередьОбработкиДанных.ОбъектМетаданных КАК ОбъектМетаданных,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОчередьОбработкиДанных.ОбъектМетаданных) КАК ОбъектМетаданныхПредставление,
		|	ОчередьОбработкиДанных.ОбъектМетаданных.ИменаРеквизитовТипаДата КАК ОбъектМетаданныхИменаРеквизитовТипаДата,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОчередьОбработкиДанных.ИнформационнаяБаза) КАК ИнформационнаяБазаПредставление,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза.ПутьНаВебСервере КАК ИнформационнаяБазаПутьНаВебСервере,
		|	ОчередьОбработкиДанных.Результат КАК Результат,
		|	ОчередьОбработкиДанных.Получатели КАК Получатели,
		|	ОчередьОбработкиДанных.ОбменДанных.ОбработчикРезультата КАК ОбработчикРезультата,
		|	ОчередьОбработкиДанных.ОбменДанных.ОбработчикРезультата.Наименование КАК ОбработчикРезультатаНаименование,
		|	ОчередьОбработкиДанных.ОбменДанных.ОбработчикРезультата.ИмяПроцедуры КАК ИмяПроцедурыОбработчикаРезультата,
		|	ОчередьОбработкиДанных.ОбменДанных.ИмяРегистра КАК ОбменДанныхИмяРегистра
		|ИЗ
		|	РегистрСведений.ОчередьОбработкиДанных КАК ОчередьОбработкиДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ОчередьОбработки
		|		ПО ОчередьОбработкиДанных.Идентификатор = ОчередьОбработки.Идентификатор
		|			И ОчередьОбработкиДанных.ВремяИнициации = ОчередьОбработки.ВремяИнициации
		|			И ОчередьОбработкиДанных.ОбменДанных = ОчередьОбработки.ОбменДанных
		|			И ОчередьОбработкиДанных.ИнформационнаяБаза = ОчередьОбработки.ИнформационнаяБаза
		|ИТОГИ
		|	МИНИМУМ(ВремяИнициации),
		|	МИНИМУМ(ОбработчикРезультата),
		|	МИНИМУМ(ИмяПроцедурыОбработчикаРезультата)
		|ПО
		|	Идентификатор";
	Запрос.УстановитьПараметр("ТЗ", Результат);
	РезультатЗапроса = Запрос.Выполнить();
	
	ИменаРеквизитов = Новый Массив;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаРеквизитов.Добавить(Колонка.Имя);
	КонецЦикла;  
	СтрокаРек = СтрСоединить(ИменаРеквизитов, ",");
	
	ВыборкаИдентификатор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	Пока ВыборкаИдентификатор.Следующий() Цикл  
		
		Если Не ЗначениеЗаполнено(ВыборкаИдентификатор.ИмяПроцедурыОбработчикаРезультата) Тогда
			Постобработчики.ЗаписатьРезультат(ВыборкаИдентификатор, НСтр("ru = 'Не указан обработчик результата.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			Продолжить;
		КонецЕсли;  
		
		ВсеЗаписиПоИдентификатору = Новый Массив;
		
		Выборка = ВыборкаИдентификатор.Выбрать();
		Пока Выборка.Следующий() Цикл  
			ЗаписьВОчереди = Новый Структура(СтрокаРек); 
			ЗаполнитьЗначенияСвойств(ЗаписьВОчереди, Выборка);
			ВсеЗаписиПоИдентификатору.Добавить(ЗаписьВОчереди);	 			
		КонецЦикла;  
		
		ТекстОшибки = "";
		Постобработчики.ВыполнитьПостобработчик(ВсеЗаписиПоИдентификатору, ВыборкаИдентификатор.ИмяПроцедурыОбработчикаРезультата, ТекстОшибки);   
		Постобработчики.ЗаписатьРезультат(ВыборкаИдентификатор, ТекстОшибки); 	
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Команда)  
	МассивВС = Новый Массив;  
	Для Каждого ТекВыд Из Элементы.Список.ВыделенныеСтроки Цикл  
		ТД = Элементы.Список.ДанныеСтроки(ТекВыд);
		МассивВС.Добавить(ТД);
	КонецЦикла;
	ОбработатьРезультатНаСервере(МассивВС);
КонецПроцедуры
